{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "print(\"hi2\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Name': 'Joy Ann Church',\n",
       "  'Gender': 'Female',\n",
       "  'Born': '6/16/1971',\n",
       "  'Born Location': 'Berwick, PA',\n",
       "  'Died': '',\n",
       "  'Died Location': '',\n",
       "  'Mother': '',\n",
       "  'Father': '',\n",
       "  'Married to': 'Randall Lee Murphy',\n",
       "  'Married Date': '12/28/1996',\n",
       "  'Married Location': 'Northumberland, PA',\n",
       "  'Second Marriage to': '',\n",
       "  'Second Marriage Date': '',\n",
       "  'Second Marriage Location': '',\n",
       "  'Third Marriage to': '',\n",
       "  'Third Marriage Date': '',\n",
       "  'Notes': 'Divorced on 10/4/2011',\n",
       "  '': ''},\n",
       " {'Name': 'Hannah Joy Murphy',\n",
       "  'Gender': 'Female',\n",
       "  'Born': '9/16/2000',\n",
       "  'Born Location': 'Lewisburg, PA',\n",
       "  'Died': '',\n",
       "  'Died Location': '',\n",
       "  'Mother': 'Joy Ann Church',\n",
       "  'Father': 'Randall Lee Murphy',\n",
       "  'Married to': '',\n",
       "  'Married Date': '',\n",
       "  'Married Location': '',\n",
       "  'Second Marriage to': '',\n",
       "  'Second Marriage Date': '',\n",
       "  'Second Marriage Location': '',\n",
       "  'Third Marriage to': '',\n",
       "  'Third Marriage Date': '',\n",
       "  'Notes': '',\n",
       "  '': ''}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import csv\n",
    "\n",
    "def make_person_id(name):\n",
    "    return name.lower().replace(' ','_').replace('.','').replace('(','').replace(')','').replace('-','') \\\n",
    "    .replace('\"','').replace(\"'\",'').replace('?','').replace('\\\\','').replace('’','').replace('“','') \\\n",
    "    .replace('”','')\n",
    "\n",
    "with open('/Users/chadarmstrong/Library/Mobile Documents/com~apple~CloudDocs/Archive/Programming/Node/geneology_github/data/Geneology.csv') as csv_file:\n",
    "    people = list(csv.DictReader(csv_file))\n",
    "\n",
    "people[100:102]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "34 Joseph Armstrong\n",
      "35 Ann Waldron\n",
      "36 Jehiel Armstrong\n",
      "37 Rebecca Starks\n",
      "38 Thomas Waldron Armstrong\n",
      "39 Miles Aldridge Armstrong\n",
      "40 Alida A. Adams\n",
      "41 Frank Miles Armstrong\n",
      "42 Alice M. Haskins\n",
      "43 Walter Armstrong\n",
      "44 Claude Armstrong\n",
      "45 Pearl Armstrong\n",
      "46 Aubrey Armstrong\n",
      "47 Guy Armstrong\n",
      "48 Richard (Dick) Harry Armstrong\n",
      "49 Eleanor Bullock\n",
      "50 Noela Griffin\n",
      "51 Edgar Harry Armstrong\n",
      "52 Christine Fae (“Tini”) Chaffee\n",
      "53 Doris Armstrong\n",
      "54 Melissa A. Armstrong Adams\n",
      "55 Laura Jane Armstrong\n",
      "56 Charles Wesley Mosher\n",
      "57 Colleen Abigail Armstrong\n",
      "58 Jerry Quick\n",
      "59 Michael Edward Quick\n",
      "60 Elizabeth Anne Quick\n",
      "61 Edgar David Armstrong\n",
      "62 Carol Marie Murphy\n",
      "63 Chad David Armstrong\n",
      "64 Michael David Killen\n",
      "65 Cynthia Carson\n",
      "66 Michael Killen\n",
      "67 Brett Nolan Armstrong\n",
      "68 Heather Dawn Seymour\n",
      "69 Brielle Nicole Armstrong\n",
      "70 Annika Noel Armstrong\n",
      "71 Sean Patrick Armstrong\n",
      "72 Renee Elizabeth Glick\n",
      "73 Renaissance Lenore Armstrong\n",
      "74 Mason Quade Armstrong\n",
      "75 Timothy Lee Armstrong\n",
      "76 Patricia Dyess\n",
      "77 Timothy James Armstrong\n",
      "78 Meredith Rae Armstrong\n",
      "79 Justin Coffman\n",
      "80 Callie Ann Armstrong\n",
      "81 Tyler Lee Armstrong\n",
      "82 Peter Jay Armstrong\n",
      "83 Pamela Joy Armstrong\n",
      "84 Jeffrey Dubert\n",
      "85 Stephen Jeffrey Dubert\n",
      "86 Michael Scott Dubert\n",
      "87 Thomas Charles Armstrong\n",
      "88 Laurie Potter\n",
      "89 Michelle Lynn Armstrong\n",
      "90 Sam J. Holder\n",
      "91 Benjamin Thomas Armstrong\n",
      "92 John Gregory Armstrong\n",
      "93 Kelly Teeter\n",
      "94 Sarah Elizabeth Armstrong\n",
      "95 Bethany Grace Armstrong\n",
      "96 Ashley Marie Armstrong\n",
      "97 Joshua David Armstrong\n",
      "98 Emily Rose Armstrong\n",
      "99 Caleb John Armstrong\n",
      "100 Daniel Jacob Armstrong\n",
      "101 Daniel Jean (Jene) Murphy\n",
      "102 Miriam Amanda Kleppinger\n",
      "103 Paul Allen Murphy\n",
      "104 Donna Jardine\n",
      "105 Lynda LeFoll LeVasseur\n",
      "106 Marc Thomas LeVasseur\n",
      "107 Jonathan Alexander LeVasseur\n",
      "108 Tamara Sue Murphy\n",
      "109 Jeffrey Paul Murphy\n",
      "110 Kevin Alan Webster\n",
      "111 Lance Kevin Webster\n",
      "112 Lyle Allen Webster\n",
      "113 Lynn Carol Randall\n",
      "114 Daniel Paul Murphy\n",
      "115 Brandon Lee Murphy\n",
      "116 Julie Ann Thompson\n",
      "117 Morgan Brittney Murphy\n",
      "118 Maxwell Storer\n",
      "119 Miles Gerrish Murphy\n",
      "120 Nicholas Thompson\n",
      "121 Kathryn Millet\n",
      "122 Abel Thompson\n",
      "123 Martha Mae Murphy\n",
      "124 Ronald Lee Murphy\n",
      "125 Martha Ellen Oplinger\n",
      "126 Randall Lee Murphy\n",
      "127 Marilyn Irene Murphy\n",
      "128 Rodney Lynn Murphy\n",
      "129 Richard Lewis Murphy\n",
      "130 Judy Anderson\n",
      "131 Randall Cyril Murphy\n",
      "132 Adrian Michael Murphy\n",
      "133 Melody Ann Murphy\n",
      "134 Joy Ann Church\n",
      "135 Hannah Joy Murphy\n",
      "136 Ryan Lee Murphy\n",
      "137 Steven Earl Davis\n",
      "138 James Fredrick Davis\n",
      "139 Stefanie Nicole Davis\n",
      "140 Cheri Hoffman\n",
      "141 Rodney Lynn Murphy II\n",
      "142 Ricky Lynn Murphy\n",
      "143 Emily Ann Dettmer\n",
      "144 Emma LeeAnn Murphy\n",
      "145 Phyllis Ellen Murphy\n",
      "146 Warren Lawrence Palmer\n",
      "147 Kelly Lynn Palmer\n",
      "148 Kevin Lee Palmer\n",
      "149 Kyle Lane Palmer\n",
      "150 Jody Todd Bliss\n",
      "151 Shawn Rakchon Bliss\n",
      "152 Cole Ratchasi Bliss\n",
      "153 Rachel Elizabeth Smith\n",
      "154 Lily Marie Bliss\n",
      "155 Jean Leigh Avery\n",
      "156 Derek Carver Palmer\n",
      "157 Branden Cooper Palmer\n",
      "158 Kathleen Wojnowicz-Kott\n",
      "159 Mackenzie Morseman\n",
      "160 Rosana Flordeliz Marcial\n",
      "161 Ashley Nicole Palmer\n",
      "162 Kayla Marie Palmer\n",
      "163 Luke Marcial Palmer\n",
      "164 Mark Elden Murphy\n",
      "165 Diann Marie Semski\n",
      "166 James Adam Murphy\n",
      "167 Mathew Brennen Murphy\n",
      "168 Janie Denise Barrett\n",
      "169 Alexander James Murphy\n",
      "170 Haven Lu Murphy\n",
      "171 Hope Noelle Murphy\n",
      "172 Karen Sue Davis\n",
      "173 Jason Owen Murphy\n",
      "174 Levi Jonathan Murphy\n",
      "175 Sarah Mae Murphy\n",
      "176 Hannah Rae Murphy\n",
      "177 Gene Elbert Murphy\n",
      "178 Vada Mae Smith\n",
      "179 Martha Honsberger\n",
      "180 Karen Mae Murphy\n",
      "181 Daniel Gene Murphy\n",
      "182 Jaime Lynn Murphy\n",
      "183 Matthew Thomas Slezak\n",
      "184 Kaitlyn Mae Slezak\n",
      "185 Jonathan Thomas Slezak\n",
      "186 Erika Joy (Clark) Jones\n",
      "187 Logan Xavier Murphy\n",
      "188 Kurt William Sickinger\n",
      "189 Colin Murphy Sickinger\n",
      "190 Molly Murphy Sickinger\n",
      "191 Mary Ann Murphy\n",
      "192 Franklin James Smalley\n",
      "193 Tara Mae Smalley\n",
      "194 Tighe James Smalley\n",
      "195 Tobiah Nathaniel Smalley\n",
      "196 Trevor Lee Smalley\n",
      "197 Nathan James Reimer\n",
      "198 Alexander Nathaniel Reimer\n",
      "199 Ainslie Elisabeth Reimer\n",
      "200 Adeline Reese Reimer\n",
      "201 Jessica Kristen Shannon\n",
      "202 Elenna Marie Kuhn\n",
      "203 Hannah Ruth Hesed Forbes\n",
      "204 Larry Ray Murphy\n",
      "205 Linda Lou Barber\n",
      "206 Alice Elizabeth Murphy\n",
      "207 Denise Lynn Murphy\n",
      "208 Matt Gibson\n",
      "209 Darrian Amanda Gibson\n",
      "210 Jaden Reese Gibson\n",
      "211 Todd William Day\n",
      "212 Brenen Daniel Todd Murphy\n",
      "213 Ethan William Day\n",
      "214 Andrew Scott Evans\n",
      "215 Scott Evans\n",
      "216 John Daniel Murphy\n",
      "217 Rhonda Kay Patterson\n",
      "218 Joshua John Murphy\n",
      "219 Rosa Hong\n",
      "220 Logan Joshua Murphy\n",
      "221 Isabel Rose Murphy\n",
      "222 John George Kleppinger\n",
      "223 Ludwig Kleppinger\n",
      "224 Lewis Kleppinger\n",
      "225 David Kleppinger\n",
      "226 Lovina Kuntz\n",
      "227 Catherine Cordelia Kleppinger\n",
      "228 Louisa H. Kleppinger\n",
      "229 Thomas M. Gable\n",
      "230 Joseph H. Kleppinger\n",
      "231 Mary Gemmel\n",
      "232 Annie M.E. Kleppinger\n",
      "233 John Newhard\n",
      "234 Charles Kleppinger\n",
      "235 James M. Kleppinger\n",
      "236 Marietta Boyer\n",
      "237 George Herman Kleppinger\n",
      "238 Clara S. Wilson\n",
      "239 Thomas M. Kleppinger\n",
      "240 Lena M. Peiffley\n",
      "241 Sarah E. Kleppinger\n",
      "242 Albert D. George\n",
      "243 Nellie George\n",
      "244 Dr. Nathaniel Ritter\n",
      "245 William David Kleppinger (first)\n",
      "246 Adina Rebecca Kleppinger\n",
      "247 Franklin Sylvester Dreisbach\n",
      "248 Jeremiah Wilson Kleppinger\n",
      "249 Amanda R. Hummel\n",
      "250 Matilda (Solt) Humel\n",
      "251 William H. Humel\n",
      "252 William David Kleppinger\n",
      "253 Wallace Edgar Kleppinger\n",
      "254 Sallie B. Clymer\n",
      "255 Ernest Jeremiah Oplinger\n",
      "256 Minnie May Kleppinger\n",
      "257 Edward C. Oswald\n",
      "258 Harold Kleppinger Oswald\n",
      "259 Marguerite McQuilken\n",
      "260 Jean Louise Oswald\n",
      "261 Ray C. Gilbert\n",
      "262 Cheryl Ann Gilbert\n",
      "263 Pauline A. Oswald\n",
      "264 Alton F. Wagaman\n",
      "265 Elaine Lois Wagaman\n",
      "266 Frank Franz\n",
      "267 Laura Estella Kleppinger\n",
      "268 Newton J. Oplinger\n",
      "269 Gladys Estella Oplinger\n",
      "270 C. Leon Dieter\n",
      "271 Carl Leon Dieter\n",
      "272 Lucille Doris Dieter\n",
      "273 Jean Ruth Dieter\n",
      "274 Lloyd J. Liggitt\n",
      "275 James Leon (Jimmy) Liggitt\n",
      "276 Ronald Earl Liggitt\n",
      "277 Larry Lee Liggitt\n",
      "278 Paul David Dieter\n",
      "279 Jane Price\n",
      "280 David Dean Dieter\n",
      "281 Vincent Newton Dieter\n",
      "282 John Oplinger\n",
      "283 Florence Nora Oplinger\n",
      "284 Gilbert J. Ziegenfuss\n",
      "285 Alton David Ziegenfuss\n",
      "286 Naomi G. Kleppinger\n",
      "287 Joan Dorothy Ziegenfuss\n",
      "288 Dorothy Remley\n",
      "289 Sandra Jean Oplinger\n",
      "290 Suzanne Dorothy Oplinger\n",
      "291 Elsie Jane Kleppinger\n",
      "292 Victor E. Schaeffer\n",
      "293 Elvin Roy Schaffer\n",
      "294 Pearl Mae Buss\n",
      "295 Sheila Mae Schaffer\n",
      "296 Neil Roy Schaffer\n",
      "297 Eileen Schaffer\n",
      "298 Isabel Mary Shaffer\n",
      "299 Matthew E. Givler\n",
      "300 Robert L. Benner\n",
      "301 Harry Lewis Kleppinger\n",
      "302 Eva R. Manbeck\n",
      "303 Eugene Manbeck Kleppinger\n",
      "304 Jane Houser\n",
      "305 Geneva Mae Kleppinger\n",
      "306 Kathy Jane Kleppinger\n",
      "307 Harry Earl Kleppinger\n",
      "308 May Amanda Kleppinger\n",
      "309 Eugene Filbert\n",
      "310 Foster Gerhard\n",
      "311 Roy Edward Kleppinger\n",
      "312 Dorothy Morgan\n",
      "313 Ruth Naomi Kleppinger\n",
      "314 Elwood A. Vack\n",
      "315 Donald Jesse Vack\n",
      "316 Nora Alice Kleppinger\n",
      "317 Warren W. Wehr\n",
      "318 Evelyn Alice Wehr\n",
      "319 Donald Lewis Wehr\n",
      "320 Harriet Butz\n",
      "321 Arline Fay Wehr\n",
      "322 Pauline May Wehr\n",
      "323 Berdie B. Yenser\n",
      "324 Frank Albert Kleppinger\n",
      "325 Sally Florence Schappell\n",
      "326 Russell Alfred Kleppinger\n",
      "327 Annabelle Russell\n",
      "328 Donald Ray Kleppinger\n",
      "329 Janet Kay Kleppinger\n",
      "330 Keith Russell Kleppinger\n",
      "331 Arthur Jeremiah Kleppinger\n",
      "332 Ethel York\n",
      "333 Gloria Ray Kleppinger\n",
      "334 Richard Arthur Kleppinger\n",
      "335 Wesley Albert Kleppinger\n",
      "336 Eugene David Kleppinger\n",
      "337 Willard David Kleppinger\n",
      "338 Maxine Sypolt\n",
      "339 Dawn Elaine Kleppinger\n",
      "340 David J. Jalosky\n",
      "341 Daryl D. Jalosky\n",
      "342 Joyce Gay Kleppinger\n",
      "343 Patti Kleppinger\n",
      "344 Robert Jesse Kleppinger\n",
      "345 Betty Jean Smith\n",
      "346 Karen Kay Kleppinger\n",
      "347 Robert Keith Kleppinger\n",
      "348 David Merrill Kleppinger\n",
      "349 Homer Kleppinger\n",
      "350 Ruth Elizabeth Kleppinger\n",
      "351 Wilson D. Miller\n",
      "352 Leonard Wilson Miller\n",
      "353 Bonnie Ruth Miller\n",
      "354 Barry Lee Miller\n",
      "355 Sally Ann Miller\n",
      "356 Glenn Dale Miller\n",
      "357 Bruce Allen Miller\n",
      "358 Brian Carson Miller\n",
      "359 Thomas Charles Chaffee\n",
      "360 Mary Emma Palmer\n",
      "361 Maynard Thomas Chaffee\n",
      "362 Vivian Wright\n",
      "363 Elbert Basil “Punk” Chaffee\n",
      "364 Gertrude Ernestine Lundgren\n",
      "365 Doris Mae “Dor” Chaffee\n",
      "366 Stanley Delos Henry\n",
      "367 Mary Pauline “Pauline” or “Deed”  Chaffee\n",
      "368 Raymond Tompkins\n",
      "369 Madge Elaine Chaffee\n",
      "370 Charles Wilson\n",
      "371 Charlotte Evelyn “Char\" Chaffee\n",
      "372 Donald Eugene Philips\n",
      "373 Phyllis Wealthy “Phyl” Chaffee\n",
      "374 Robert LeRoy Tompkins\n",
      "375 La Verna Estelle Chaffee\n",
      "376 John Adams\n",
      "377 Richard Scott “Scotty” Adams\n",
      "378 Sandy Cook\n",
      "379 Scotty Adams\n",
      "380 Julie Adams\n",
      "381 David John Adams\n",
      "382 Widi Adams\n",
      "383 Michael David Adams\n",
      "384 John Ellsworth Adams Jr.\n",
      "385 Kimberlee Ann Adams\n",
      "386 Chris Stamberger\n",
      "387 Thayne Maxwell “Max” Stamberger\n",
      "388 Phillip Maynard Chaffee\n",
      "389 Shirley Hayes\n",
      "390 Deborah Ann “Debi” Chaffee\n",
      "391 Donald Swearingen\n",
      "392 Tammy Jo Swearingen\n",
      "393 Kyle Swearingen\n",
      "394 Steven Michael Chaffee\n",
      "395 James Andrew Chaffee\n",
      "396 Sandy Beardsley\n",
      "397 Jason Chaffee\n",
      "398 Susan Stockham\n",
      "399 Thomas Maynard Chaffee\n",
      "400 Joann Chaffee\n",
      "401 Amanda Chaffee\n",
      "402 Nicole Chaffee\n",
      "403 Brandon Chaffee\n",
      "404 Debbie Hall\n",
      "405 Pixie Lott\n",
      "406 Terrance Newman “Terry” Chaffee\n",
      "407 Dorothy Cortez\n",
      "408 Carol Ann Chaffee\n",
      "409 Terrance Newman Chaffee Jr.\n",
      "410 Michael Chaffee\n",
      "411 Thomas Ira Chaffee\n",
      "412 Betty Lauerback\n",
      "413 Jan Chaffee\n",
      "414 Julie Rose Chaffee\n",
      "415 Thomas Ira Chaffee Jr.\n",
      "416 Anna Jo Chaffee\n",
      "417 Judith Fay “Judy” Chaffee\n",
      "418 Ronald L. Steve\n",
      "419 Terry Lee Steve\n",
      "420 Daniel Louis Steve\n",
      "421 Veronica Steve\n",
      "422 Vicki Steve\n",
      "423 Brooks Hendrix\n",
      "424 Jesse Steve\n",
      "425 Amber Steve\n",
      "426 Jo Ann Chaffee\n",
      "427 Thomas Morse\n",
      "428 Timmy Morse\n",
      "429 Susan Morse\n",
      "430 Bonnie Morse\n",
      "431 Penny Marie Morse\n",
      "432 John Stanley “Jack” Chaffee\n",
      "433 Janet Bolt\n",
      "434 Alan Charles Chaffee\n",
      "435 Helen Miller\n",
      "436 Mary Emma Palmer “Mamie” Chaffee\n",
      "437 Dana Elliott Weed\n",
      "438 Seth Andrew Charles Chaffee\n",
      "439 Ethan William Palmer Chaffee\n",
      "440 Charity Lynn Rager\n",
      "441 Titus Easton Chaffee\n",
      "442 Robert Earnest “Bob” Chaffee\n",
      "443 Ann Rothermich\n",
      "444 Desmond Stanley Henry\n",
      "445 Mary Lou Bower\n",
      "446 Terry Michael Henry\n",
      "447 Todd Andrew Henry\n",
      "448 Desiree Ann Henry\n",
      "449 Maureen Anne Henry\n",
      "450 Marie Alane Henry\n",
      "451 Brian Thomas Henry\n",
      "452 Brett Anthony Henry\n",
      "453 Dennis Michael “Denny Mike” Henry\n",
      "454 Julia Alliene (Judy) Fenner\n",
      "455 Darlene Marie Henry\n",
      "456 David Allen McMillen\n",
      "457 David Allen McMillen Jr.\n",
      "458 Katie McMillen\n",
      "459 Brandon Michael McMillen\n",
      "460 Cassie Alliene McMillen\n",
      "461 Sierra Lynn ??\n",
      "462 James Edward Henry\n",
      "463 Tina Louise Bordenett\n",
      "464 Cale James Henry\n",
      "465 Sierra Lynn Henry\n",
      "466 Stanley Richard Henry\n",
      "467 Joseph Michael Burbee Henry\n",
      "468 Kathleen Kaye “KK” Henry\n",
      "469 Bernard Baldwin\n",
      "470 David Ronald Harrington\n",
      "471 Robert Corrington\n",
      "472 Hollace “Holly” Ardelle Henry\n",
      "473 Kathleen “Kathy” Elizabeth Henry\n",
      "474 Stanley James Orr\n",
      "475 Willard A. Newman\n",
      "476 Marion Wayne Correll\n",
      "477 Vikki Lynn Orr\n",
      "478 James Deloss Orr\n",
      "479 Belinda Leigh Orr\n",
      "480 Michelle Elizabeth Newman\n",
      "481 Holly Rene Newman\n",
      "482 Jordan Kaveh Orr\n",
      "483 Justin Khalil Orr\n",
      "484 Jarel Lamont Orr\n",
      "485 Jhavonte Aasin Moon\n",
      "486 Aaliyah Dorisa Lucas\n",
      "487 Amare Andre Lucas\n",
      "488 Mary Jo Wilson\n",
      "489 David Austic\n",
      "490 Gene Cobb\n",
      "491 Jacob Cobb\n",
      "492 Michael Green Phillips\n",
      "493 Rebecca Lou “Becky” Tompkins\n",
      "494 Gilbert Norris\n",
      "495 Jennifer Lyn Norris\n",
      "496 Scott Nagell\n",
      "497 Liam Robert Nagell\n",
      "498 Christopher Nagell\n",
      "499 Cavan Nagell\n",
      "500 Braden Nagell\n",
      "501 Daniel Robert Tompkins\n",
      "502 Randy Lee Tompkins\n",
      "503 Fae Elaine Hovencamp\n",
      "504 Nathan Lee Tompkins\n",
      "505 Kim Conroy\n",
      "506 Alora Piper\n",
      "507 Vicky Tompkins\n",
      "508 Brenda Fairbanks\n",
      "509 Ian Robert Tompkins\n",
      "510 Lucienne Binkerd-Dale\n",
      "511 Emily Fae Tompkins\n",
      "512 Nancy Ann Minturn\n",
      "513 Theodore “Theo” Ivory\n",
      "514 Abby Deanne Tompkins\n",
      "515 Michael John Hubbell\n",
      "516 Erin Lee Spicer\n",
      "517 Gabriel Jet Hubbell\n",
      "518 Polly Ann Tompkins\n",
      "519 Joe Taricska\n",
      "520 Michael Robert Taricska\n",
      "521 Emmalee O’Donnell\n",
      "522 Brian Joseph Taricska\n",
      "523 Candace Loreen Armstrong\n"
     ]
    }
   ],
   "source": [
    "count = 34\n",
    "for person in people:\n",
    "    print(str(count) + ' ' + person['Name'])\n",
    "    count = count + 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "for person in people:\n",
    "    print(\"CREATE (\" + make_person_id(person['Name']) + \\\n",
    "    \":Person {name:'\" + person['Name'] + \"', birth_date:'\" + person['Born'] + \"', birth_location:'\" + \\\n",
    "person['Born Location'] + \"', death_date:'\" + person['Died'] + \"', death_location:'\" + person['Died Location'] + \"'})\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "print(people[1])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "print('Joseph Armstrong'.lower().replace(' ','_'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "person = people[3]\n",
    "print(person)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def make_person_id(name):\n",
    "    return name.lower().replace(' ','_').replace('.','').replace('(','').replace(')','').replace('-','') \\\n",
    "    .replace('\"','').replace(\"'\",'').replace('?','').replace('\\\\','')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "last_relationship = None\n",
    "\n",
    "for person in people[40:90]:\n",
    "    p = make_person_id(person['Name'])\n",
    "    m = make_person_id(person['Mother'])\n",
    "    f = make_person_id(person['Father'])\n",
    "    s = make_person_id(person['Married to'])\n",
    "\n",
    "    if person['Mother'] is not '':\n",
    "        print(\"MATCH ({}:Person), ({}:Person) WHERE  {}.name = '{}' and {}.name = '{}'\".format(m,p,m,person['Mother'],p,person['Name']))\n",
    "        print(\"CREATE ({})-[:MOTHER]->({})\".format(m,p))\n",
    "        print(\"WITH {},{}\".format(m,p))\n",
    "        last_relationship = m\n",
    "        #print \"RETURN m,p\"\n",
    "    if person['Father'] is not '':\n",
    "        print(\"MATCH ({}:Person), ({}:Person) WHERE  {}.name = '{}' and {}.name = '{}'\".format(f,p,f,person['Father'],p,person['Name']))\n",
    "        print(\"CREATE ({})-[:FATHER]->({})\".format(f,p))\n",
    "        print(\"WITH {},{}\".format(f,p))\n",
    "        last_relationship = f\n",
    "        #print \"RETURN m,p\"\n",
    "    if person['Married to'] is not '':\n",
    "        print(\"MATCH ({}:Person), ({}:Person) WHERE  {}.name = '{}' and {}.name = '{}'\".format(s,p,s,person['Married to'],p,person['Name']))\n",
    "        print(\"CREATE ({})-[:MARRIED]->({})\".format(s,p))\n",
    "        print(\"WITH {},{}\".format(s,p))\n",
    "        last_relationship = s\n",
    "\n",
    "print(f\"RETURN {last_relationship or ''}\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "len(people)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "people[97]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "from neo4j.v1 import GraphDatabase\n",
    "\n",
    "uri = \"bolt://localhost:7687\"\n",
    "driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"aJZ=Ecq4\"))\n",
    "\n",
    "def print_married_to(name):\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            for record in tx.run(\"MATCH (a:Person)-[:MARRIED]->(f) \"\n",
    "                                 \"WHERE a.name = {name} \"\n",
    "                                 \"RETURN f.name\", name=name):\n",
    "                print(record[\"f.name\"])\n",
    "\n",
    "print_married_to(\"Joseph Armstrong\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting neo4j\n",
      "  Downloading neo4j-5.28.1-py3-none-any.whl.metadata (5.9 kB)\n",
      "Requirement already satisfied: pytz in /Users/chadarmstrong/Obsidian/Obsidian Vault/.conda/lib/python3.11/site-packages (from neo4j) (2023.3.post1)\n",
      "Downloading neo4j-5.28.1-py3-none-any.whl (312 kB)\n",
      "\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m312.3/312.3 kB\u001b[0m \u001b[31m6.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m00:01\u001b[0m\n",
      "\u001b[?25hInstalling collected packages: neo4j\n",
      "Successfully installed neo4j-5.28.1\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: neo4j-driver in /Users/chadarmstrong/Obsidian/Obsidian Vault/.conda/lib/python3.11/site-packages (5.28.1)\n",
      "Requirement already satisfied: pytz in /Users/chadarmstrong/Obsidian/Obsidian Vault/.conda/lib/python3.11/site-packages (from neo4j-driver) (2023.3.post1)\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "%pip install neo4j\n",
    "\n",
    "%pip install neo4j-driver"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def make_person(person):\n",
    "    #print(person)\n",
    "    statement = (\"CREATE (\" + make_person_id(person['Name']) + \":Person {name:'{name}', birth_date:'{birth_date}', \"\n",
    "                 \"birth_location:'{birth_location}', \"\n",
    "                 \"death_date:'{death_date}', death_location:'{death_location}'})\")\n",
    "\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            result = tx.run(statement, {\"person_id\": make_person_id(person['Name']),\n",
    "                                \"name\": person['Name'],\n",
    "                                \"birth_date\": person['Born'],\n",
    "                                \"birth_location\": person['Born Location'],\n",
    "                                \"death_date\": person['Died'],\n",
    "                                \"death_location\": person['Died Location']})\n",
    "            print('Created ' + person['Name'])\n",
    "\n",
    "# for person in people[0:10]:\n",
    "#     make_person(person)\n",
    "\n",
    "# for person in people:\n",
    "#     print \"CREATE (\" + make_person_id(person['Name']) + \\\n",
    "#     \":Person {name:'\" + person['Name'] + \"', birth_date:'\" + person['Born'] + \"', birth_location:'\" + \\\n",
    "# person['Born Location'] + \"', death_date:'\" + person['Died'] + \"', death_location:'\" + person['Died Location'] + \"'})\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def make_relationships(person):\n",
    "    p = make_person_id(person['Name'])\n",
    "    m = make_person_id(person['Mother'])\n",
    "    f = make_person_id(person['Father'])\n",
    "    s = make_person_id(person['Married to'])\n",
    "\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            if person['Mother'] is not '':\n",
    "                r = m\n",
    "                tx.run(\"MATCH ({}:Person), ({}:Person) WHERE  {}.name = '{}' and {}.name = '{}'\"\n",
    "                        \" CREATE ({})-[:MOTHER]->({}) WITH {},{}\"\n",
    "                        \" RETURN {},{}\".format(r,p,r,person['Mother'],p,person['Name'],r,p,r,p,r,p))\n",
    "                print(\"{} - :MOTHER -> {}\".format(r,p))\n",
    "            if person['Father'] is not '':\n",
    "                r = f\n",
    "                tx.run(\"MATCH ({}:Person), ({}:Person) WHERE  {}.name = '{}' and {}.name = '{}'\"\n",
    "                        \" CREATE ({})-[:FATHER]->({}) WITH {},{}\"\n",
    "                        \" RETURN {},{}\".format(r,p,r,person['Father'],p,person['Name'],r,p,r,p,r,p))\n",
    "                print(\"{} - :FATHER -> {}\".format(r,p))\n",
    "            if person['Married to'] is not '':\n",
    "                r = s\n",
    "                tx.run(\"MATCH ({}:Person), ({}:Person) WHERE  {}.name = '{}' and {}.name = '{}'\"\n",
    "                        \" CREATE ({})-[:MARRIED]->({}) WITH {},{}\"\n",
    "                        \" RETURN {},{}\".format(r,p,r,person['Married to'],p,person['Name'],r,p,r,p,r,p))\n",
    "                print(\"{} - :MARRIED -> {}\".format(r,p))\n",
    "\n",
    "# for person in people[0:10]:\n",
    "#     make_relationships(person)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import csv\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "localhost = False\n",
    "\n",
    "if localhost:\n",
    "    uri = \"bolt://localhost:7687\"\n",
    "    driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"aJZ=Ecq4\"))\n",
    "else:\n",
    "    uri = \"bolt://52.205.81.5:7687\"\n",
    "    driver = GraphDatabase.driver(uri, auth=(\"neo4j\", \"7i=fBzYZ\"))\n",
    "\n",
    "with open('/Users/chada/Desktop/Archive/Programming/Node/geneology/data/Geneology.csv') as csv_file:\n",
    "    people = list(csv.DictReader(csv_file))\n",
    "\n",
    "def deleteAll():\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            result = tx.run('MATCH (n) DETACH DELETE n')\n",
    "            print('Deleted everything!')\n",
    "\n",
    "def make_person_id(name):\n",
    "    return name.lower().replace(' ','_').replace('.','').replace('(','').replace(')','').replace('-','') \\\n",
    "    .replace('\"','').replace(\"'\",'').replace('?','').replace('\\\\','').replace('’','').replace('“','') \\\n",
    "    .replace('”','')\n",
    "\n",
    "def make_person(person):\n",
    "    #print(person)\n",
    "    statement = (\"CREATE (\" + make_person_id(person['Name']) + \":Person {name:{name}, gender:{gender}, birth_date:{birth_date}, \"\n",
    "                 \"birth_location:{birth_location}, \"\n",
    "                 \"death_date:{death_date}, death_location:{death_location}})\")\n",
    "\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            result = tx.run(statement, {\"person_id\": make_person_id(person['Name']),\n",
    "                                \"name\": person['Name'],\n",
    "                                \"gender\": person['Gender'],\n",
    "                                \"birth_date\": person['Born'],\n",
    "                                \"birth_location\": person['Born Location'],\n",
    "                                \"death_date\": person['Died'],\n",
    "                                \"death_location\": person['Died Location']})\n",
    "            print('Created ' + person['Name'])\n",
    "\n",
    "\n",
    "def make_relationships(person):\n",
    "    p = make_person_id(person['Name'])\n",
    "    m = make_person_id(person['Mother'])\n",
    "    f = make_person_id(person['Father'])\n",
    "    s = make_person_id(person['Married to'])\n",
    "\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            if person['Mother'] != '':\n",
    "                r = m\n",
    "\n",
    "                query = (\n",
    "                    \"MATCH (r:Person), (p:Person) \"\n",
    "                    \"WHERE r.name = $mother_name AND p.name = $person_name \"\n",
    "                    \"CREATE (r)-[:MOTHER]->(p) \"\n",
    "                    \"RETURN r, p\"\n",
    "                )\n",
    "                tx.run(query, mother_name=person['Mother'], person_name=person['Name'])\n",
    "                print(f\"{r} - :MOTHER -> {p}\")\n",
    "\n",
    "                if person['Gender'] == 'Male':\n",
    "                    query = (\n",
    "                        \"MATCH (p:Person), (r:Person) \"\n",
    "                        \"WHERE r.name = $mother_name AND p.name = $person_name \"\n",
    "                        \"CREATE (p)-[:SON]->(r) \"\n",
    "                        \"RETURN p, r\"\n",
    "                    )\n",
    "                    tx.run(query, mother_name=person['Mother'], person_name=person['Name'])\n",
    "                    print(f\"{p} - :SON -> {r}\")\n",
    "                else:\n",
    "                    query = (\n",
    "                        \"MATCH (p:Person), (r:Person) \"\n",
    "                        \"WHERE r.name = $mother_name AND p.name = $person_name \"\n",
    "                        \"CREATE (p)-[:DAUGHTER]->(r) \"\n",
    "                        \"RETURN p, r\"\n",
    "                    )\n",
    "                    tx.run(query, mother_name=person['Mother'], person_name=person['Name'])\n",
    "                    print(f\"{p} - :DAUGHTER -> {r}\")\n",
    "\n",
    "            if person['Father'] != '':\n",
    "                r = f\n",
    "\n",
    "                query = (\n",
    "                    \"MATCH (r:Person), (p:Person) \"\n",
    "                    \"WHERE r.name = $father_name AND p.name = $person_name \"\n",
    "                    \"CREATE (r)-[:FATHER]->(p) \"\n",
    "                    \"RETURN r, p\"\n",
    "                )\n",
    "                tx.run(query, father_name=person['Father'], person_name=person['Name'])\n",
    "                print(f\"{r} - :FATHER -> {p}\")\n",
    "\n",
    "                if person['Gender'] == 'Male':\n",
    "                    query = (\n",
    "                        \"MATCH (p:Person), (r:Person) \"\n",
    "                        \"WHERE r.name = $father_name AND p.name = $person_name \"\n",
    "                        \"CREATE (p)-[:SON]->(r) \"\n",
    "                        \"RETURN p, r\"\n",
    "                    )\n",
    "                    tx.run(query, father_name=person['Father'], person_name=person['Name'])\n",
    "                    print(f\"{p} - :SON -> {r}\")\n",
    "                else:\n",
    "                    query = (\n",
    "                        \"MATCH (p:Person), (r:Person) \"\n",
    "                        \"WHERE r.name = $father_name AND p.name = $person_name \"\n",
    "                        \"CREATE (p)-[:DAUGHTER]->(r) \"\n",
    "                        \"RETURN p, r\"\n",
    "                    )\n",
    "                    tx.run(query, father_name=person['Father'], person_name=person['Name'])\n",
    "                    print(f\"{p} - :DAUGHTER -> {r}\")\n",
    "\n",
    "            if person['Married to'] != '':\n",
    "                r = s\n",
    "\n",
    "                query = (\n",
    "                    \"MATCH (r:Person), (p:Person) \"\n",
    "                    \"WHERE r.name = $spouse_name AND p.name = $person_name \"\n",
    "                    \"CREATE (r)-[:MARRIED]->(p) \"\n",
    "                    \"RETURN r, p\"\n",
    "                )\n",
    "                tx.run(query, spouse_name=person['Married to'], person_name=person['Name'])\n",
    "                print(f\"{r} - :MARRIED -> {p}\")\n",
    "\n",
    "deleteAll()\n",
    "\n",
    "#here is a comment\n",
    "num_rows_to_process = 500\n",
    "\n",
    "for person in people[0:num_rows_to_process]:\n",
    "    make_person(person)\n",
    "\n",
    "for person in people[0:num_rows_to_process]:\n",
    "    make_relationships(person)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def deleteAll():\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            result = tx.run('MATCH (n) DETACH DELETE n')\n",
    "            print('Deleted everything!')\n",
    "\n",
    "deleteAll()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def getEverything():\n",
    "    with driver.session() as session:\n",
    "        with session.begin_transaction() as tx:\n",
    "            for record in tx.run('MATCH (n) OPTIONAL MATCH (n)-[r]->(m) RETURN n, r, m'):\n",
    "                if record['r'] is not None:\n",
    "                    record_r = record['r'].type\n",
    "                else:\n",
    "                    record_r = 'None'\n",
    "                if record['m'] is not None:\n",
    "                    record_m = record['m']['name']\n",
    "                else:\n",
    "                    record_m = 'None'\n",
    "\n",
    "                #print(record)\n",
    "                print('{} is {} to {}'.format(record['n']['name'], record_r, record_m))\n",
    "\n",
    "getEverything()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
